---
kind: method
id: M:Autodesk.Revit.DB.FabricationItemFile.IsValid
source: html/6f0112cd-e6eb-2c12-c24f-e22837b39919.htm
---
# Autodesk.Revit.DB.FabricationItemFile.IsValid Method

Checks to see if the item file is valid.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
Returns true if the item file is valid, false otherwise.